package com.star72.naming.test;

import java.math.BigDecimal;
import java.util.HashSet;
import java.util.Set;

import org.junit.Test;

import com.star72.common.utils.StarStringUtils;
import com.star72.common.utils.math.PLZUUtils;

public class CharTest {
	
	@Test
	public void test2() {
		BigDecimal paiLie = PLZUUtils.computeZuhe(10000, 5000);
		System.out.println(paiLie.toString().replace(".0", ""));
		System.out.println(paiLie.toString().replace(".0", "").length());
	}
	
	@Test
	public void test() {
		String s1 = "晨轩清睿宝涛华国亮新凯志明伟嘉东洪建文子云杰兴 友才振辰航达鹏宇衡佳强宁丰波森学民永翔鸿海飞义 生凡连良乐勇辉龙川宏谦锋双霆玉智增名进德聚军兵 忠廷先江昌政君泽超信腾恒礼元磊阳月士洋欣升恩迅 科富函业胜震福瀚瑞朔津韵荣为诚斌广庆成峰可健英 功冬锦立正禾平旭同全豪源安顺帆向雄材利希风林奇 易来咏岩启坤昊朋和纪艺昭映威奎帅星春营章高伦庭 蔚益城牧钊刚洲家晗迎罡浩景珂策皓栋起棠登越盛语 钧亿基理采备纶献维瑜齐凤毅谊贤逸卫万臻儒钢洁霖 隆远聪耀誉继珑哲岚舜钦琛金彰亭泓蒙祥意鑫朗晟晓 晔融谋宪励璟骏颜焘垒尚镇济雨蕾韬选议曦奕彦虹宣 蓝冠谱泰泊跃韦怡骁俊沣骅歌畅与圣铭溓滔溪巩影锐 展笑祖时略敖堂崊绍崇悦邦望尧珺然涵博淼琪群驰照 传诗靖会力大山之中方仁世梓竹至充亦丞州言佚序宜";
		String s2 = "婷倩睿瑜嘉君盈男萱雨乐欣悦雯晨珺月雪秀晓然冰新 淑玟萌凝文展露静智丹宁颖平佳玲彤芸莉璐云聆芝娟 超香英菲涓洁萍蓉潞笑迪敏靓菁慧涵韵琳燕依妙美宜 尚诗钰娜仪娇谊语彩清好睻曼蔓茜沁韶舒盛越琪霞艺 函迎虹爽瑞珏桐筱苹莹名晗甜晴亭吉玉晶妍凤蒙霖希 宣昕丽心可旻阳真蓝畅荣岚乔育芷姿妹姗瑾奕兰航蕾 艳怡青珊才小子允加巧冉北朵多羽如帆伶采西贝其春 易咏亚明秋泓伦朔哲益轩容玹津启婧晟婉常浩景茗尧 雅杰媛诒翔为捷钧毓意琸靖渺渲熙微祺梦赫菡纶铭齐 华菏毅瑶品梓国卿振卫叶亿娆漫兴蓓融嫒锦翰科润霏 灿忆聪怿蕊谨丰丛璇议馨瀚潇莺珑俪骄骁灵忻昭金昊 志辰宇安凡禾竹愉丫珂洺苒若偌珮棋淇群会维影逸娴 赏霄辉莲优瑷朦涛识誉巍鑫逦湾中予卉永同州任宏卓";
		String s3 = "金新中盛亚信华豪奥凯泰鑫创宝星联晨百尔海瑞科锦 乐飞福皇嘉达佰美元亮名欧特辰康讯鹏腾宏伟钧思正 成翔隆东森迪赛睿艾高德雅格纳欣亿维锐菲佳沃晟捷 博扬索蓝昂兴聚鸿略众汇圣卓宇国普绿斯登诺恒辉缘 诗香鼎碧麦邦克凡利卡多安尚川州帝悦情明滋祥逸风 彩朗郎爱景帆阳驰通骏力顺领迅途益和园波丰壹泽旭 旺融誉际巨骄为诚妙英虹芬馨尼迈群拓建江雷天策优 易威玛日伦道发唯一才月丹文立玉平同志宜林奇政朋 致春帅盈泓品庭展朔轩育航津启振聆翌迎常浩茗杰智 婷越岚超清云淼业义意资湘会菁萌语荣赫宁铭齐毅进 霆晓衡儒静翰蔚忆双涛丽韵耀艺巍兰雪尧谊影慧洁润 聪垒蕾瀚骁永吉先君依昌哲营舒曙廷渲梦瑜菏凤叶卫 臻燕霖霏莲灿颜麒韬露鹤骄厅湾凡可巧弘禾竹多帆秀 贝仑青笑宗雨虹纪亭俊禹垚秋倩宸甜加茜涵琳微菡萱";
		String s4 = "筠柔竹霭凝晓欢霄枫芸菲寒伊亚宜可姬舒影荔枝思丽秀娟英华慧巧美娜静淑惠珠翠雅芝玉萍红娥玲芬芳燕彩春菊勤珍贞莉兰凤洁梅琳素云莲真环雪荣爱妹霞香月莺媛 艳瑞凡佳嘉琼桂娣叶璧璐娅琦晶妍茜秋珊莎锦黛青倩婷姣婉娴瑾颖露瑶怡婵雁蓓纨仪荷丹蓉眉君琴蕊薇菁梦岚 苑婕馨瑗琰韵融园艺咏卿聪澜纯毓悦昭冰爽琬茗羽希宁欣飘育滢馥";
		String s5 = "梦琪忆柳之桃慕青问兰尔岚元香初夏沛菡傲珊曼文乐菱痴珊恨玉惜文香寒新柔语蓉海安夜蓉涵柏水桃醉蓝春儿语琴从彤傲晴语兰又菱碧彤元霜怜梦紫寒妙彤曼易南莲紫翠雨寒易烟如萱若南寻真晓亦向珊慕灵以蕊寻雁映易雪柳孤岚笑霜海云凝天沛珊寒云冰旋宛儿绿真盼儿晓霜碧凡夏菡曼香若烟半梦雅绿冰蓝灵槐平安书翠翠风香巧代云梦曼幼翠友巧听寒梦柏醉易访旋亦玉凌萱访卉怀亦笑蓝春翠靖柏夜蕾冰夏梦松书雪乐枫念薇靖雁寻春恨山从寒忆香觅波静曼凡旋以亦念露芷蕾千兰新波代真新蕾雁玉冷卉紫山千琴恨天傲芙盼山怀蝶冰兰山柏翠萱恨松问旋从南白易问筠如霜半芹丹珍冰彤亦寒寒雁怜云寻文乐丹翠柔谷山之瑶冰露尔珍谷雪乐萱涵菡海莲傲蕾青槐冬儿易梦惜雪宛海之柔夏青亦瑶妙菡春竹痴梦紫蓝晓巧幻柏元风冰枫访蕊南春芷蕊凡蕾凡柔安蕾天荷含玉书兰雅琴书瑶春雁从安夏槐念芹怀萍代曼幻珊谷丝秋翠白晴海露代荷含玉书蕾听白访琴灵雁秋春雪青乐瑶含烟涵双平蝶雅蕊傲之灵薇绿春含蕾从梦从蓉初丹。听兰听蓉语芙夏彤凌瑶忆翠幻灵怜菡紫南依珊妙竹访烟怜蕾映寒友绿冰萍惜霜凌香芷蕾雁卉迎梦元柏代萱紫真千青凌寒紫安寒安怀蕊秋荷涵雁以山凡梅盼曼翠彤谷冬新巧冷安千萍冰烟雅阳友绿南松诗云飞风寄灵书芹幼蓉以蓝笑寒忆寒秋烟芷巧水香映之醉波幻莲夜山芷卉向彤小玉幼南凡梦尔曼念波迎松青寒笑天涵蕾碧菡映秋盼烟忆山以寒寒香小凡代亦梦露映波友蕊寄凡怜蕾雁枫水绿曼荷笑珊寒珊谷南慕儿夏岚友儿小萱紫青妙菱冬寒曼柔语蝶青筠夜安觅海问安晓槐雅山访云翠容寒凡晓绿以菱冬云含玉访枫含卉夜白冷安灵竹醉薇元珊幻波盼夏元瑶迎曼水云访琴谷波乐之笑白之山妙海紫霜平夏凌旋孤丝怜寒向萍凡松青丝翠安如天凌雪绮菱代云南莲寻南春文香薇冬灵凌珍采绿天春沛文紫槐幻柏采文春梅雪旋盼海映梦安雁映容凝阳访风天亦平绿盼香觅风小霜雪萍半雪山柳谷雪靖易白薇梦菡飞绿如波又晴友易香菱冬亦问雁妙春海冬半安平春幼柏秋灵凝芙念烟白山从灵尔芙迎蓉念寒翠绿翠芙靖儿妙柏千凝小珍天巧。妙旋雪枫夏菡元绿痴灵绮琴雨双听枫觅荷凡之晓凡雅彤香薇孤风从安绮彤之玉雨珍幻丝代梅香波青亦元菱海瑶飞槐听露梦岚幻竹新冬盼翠谷云忆霜水瑶慕晴秋双雨真觅珍丹雪从阳元枫痴香思天如松妙晴谷秋妙松晓夏香柏巧绿宛筠碧琴盼兰小夏安容青曼千儿香春寻双涵瑶冷梅秋柔思菱醉波醉柳以寒迎夏向雪香莲以丹依凝如柏雁菱凝竹宛白初柔南蕾书萱梦槐香芹南琴绿海沛儿晓瑶听春凝蝶紫雪念双念真曼寒凡霜飞雪雪兰雅霜从蓉冷雪靖巧翠丝觅翠凡白乐蓉迎波丹烟梦旋书双念桃夜天海桃青香恨风安筠觅柔初南秋蝶千易安露诗蕊山雁友菱香露晓兰白卉语山冷珍秋翠夏柳如之忆南书易翠桃寄瑶如曼问柳香梅幻桃又菡春绿醉蝶亦绿诗珊听芹新之易巧念云晓灵静枫夏蓉如南幼丝秋白冰安秋白南风醉山初彤凝海紫文凌晴香卉雅琴傲安傲之初蝶寻桃代芹诗霜春柏绿夏碧灵诗柳夏柳采白慕梅乐安冬菱紫安宛凝雨雪易真安荷静竹代柔丹秋绮梅依白凝荷幼珊忆彤凌青之桃芷荷听荷代玉念珍梦菲夜春千秋白秋谷菱飞松初瑶惜灵恨瑶梦易新瑶曼梅碧曼友瑶雨兰夜柳香蝶盼巧芷珍香卉含芙夜云依萱凝雁以莲易容元柳安南幼晴尔琴飞阳白凡沛萍雪瑶向卉采文乐珍寒荷觅双白桃安卉迎曼盼雁乐松涵山恨寒问枫以柳含海秋春翠曼忆梅涵柳梦香海蓝晓曼代珊春冬恨荷忆丹静芙绮兰梦安紫丝千雁凝珍香萱梦容冷雁飞柏天真翠琴寄真秋荷代珊初雪雅柏怜容如风南露紫易冰凡海雪语蓉碧玉翠岚语风盼丹痴旋凝梦从雪白枫傲云白梅念露慕凝雅柔盼柳半青从霜怀柔怜晴夜蓉代双以南若菱芷文寄春南晴恨之梦寒初翠灵波巧春问夏凌春惜海亦旋沛芹幼萱白凝初露迎海绮玉凌香寻芹秋柳尔白映真含雁寒松友珊寻雪忆柏秋柏巧风恨蝶青烟问蕊灵阳春枫又儿雪巧丹萱凡双孤萍紫菱寻凝傲柏傲儿友容灵枫尔丝曼凝若蕊问丝思枫水卉问梅念寒诗双翠霜夜香寒蕾凡阳冷玉平彤语薇幻珊紫夏凌波芷蝶丹南之双凡波思雁白莲从菡如容采柳沛岚惜儿夜玉水儿半凡语海听莲幻枫念柏冰珍思山凝蕊天玉问香思萱向梦笑南夏旋之槐元灵以彤采萱巧曼绿兰平蓝问萍绿蓉靖柏。迎蕾碧曼思卉白柏妙菡怜阳雨柏雁菡梦之又莲乐荷寒天凝琴书南映天白梦初瑶恨竹平露含巧慕蕊半莲醉卉天菱青雪雅旋巧荷飞丹恨云若灵";
		String s6 = "问萍青蕾雁云芷枫千旋向梅含蓝怀丝梦文幼芙晓云雨旋秋安雁风碧槐从海语雪幼凡秋卉曼蕾问蕾访兰寄莲紫绿新雁恨容水柳南云曼阳幼蓝忆巧灵荷怜兰听曼碧双忆雁夜松映莲听曼秋易绿莲宛秋雁安问旋以蓝若亦幻丝山凡南云寄蕊绿春思海寄天友秋紫玉从筠雪海白筠灵芙安莲惜梅雪蕾寄容秋波冷云秋儿怀菱亦柏易槐怀卉紫桃向蕊易青千蕊怜露灵旋怀梅天柏半白碧安秋枫傲丝春柔冰岚雅翠易白夜灵静柔醉绿乐蕊寄蓝乐彤迎琴之亦雨寒谷山凝安曼萍碧露书南山薇念珊芷雁尔蕾绮雪傲萱新琴绿蝶慕旋怀易傲云晓梅诗菱灵珊幻香若云如霜晓晴灵山恨桃梦凝幻彤觅波慕玉念山乐桃语寒怀海孤蝶灵凝慕蓝紫青千兰孤柔语曼问海寄筠安露听晴冷寒之翠碧灵凡丝诗波友芙寄莲之蕊海琴宛筠半山依槐觅曼碧菱半文访儿芷珍绿春春蝶怜槐映露雨卉灵亦惜莲念菡南凡曼桃笑灵惜安凌筠翠菡寒雁以山秋彤巧兰山雪寒绿忆易依萱如菡含萱惜梦绮莲翠易冷筠乐槐傲青幼灵春柔恨易青文初竹从旋沛山映凝静柳雪云醉蕊巧荷思蓝翠秋";
		String s7 = "初双雪旋从霜静萍之彤晓筠含云思兰梦之醉芙若曼寻槐夜梅访安以绿新柏诗珊灵青幻菱谷双梦烟凡烟寻绿香之盼蕊香筠怀萱半蓉翠安忆卉念柏念之宛彤如竹天雪念旋笑萍海风小琴乐海易南碧蕊雁凝雁风依霜天蝶语凝之卉易云若菡幼兰巧曼以柳小天采雁易莲笑南芷雁觅霜海柏凝雪诗晴以梅绮荷乐山又梦听蓝又彤向竹安琴秋露如波尔槐小易静云梦雪幼凝慕莲如薇静秋幼柏谷易安芙觅琴冰槐诗青碧秋从琴从梦寻风凡薇夜云幼芙以彤怀云幻柳芷秋以菱靖柳紫松凡霜灵云采芙亦露香风觅蓉雨槐又雪碧蕾香松以亦芷柔千曼友山惜晴幼文寒波友岚乐槐盼蝶思山以天念梦白桃映翠雁柳翠灵以竹听雁梦丝冷烟山露安易静霜天珊念蓝书容半晴笑薇孤萱寄梦秋蕊从蝶晓曼半槐绮易访岚含丝慕安怀雁傲露天岚安寒寻雪幻旋雁彤天玉亦珊迎荷慕柏书柳春海初柏绮翠凝珍海芙尔香问旋紫之灵翠芷波曼梦向蕊笑琴映丝妙筠紫彤妙曼以阳紫筠易玉梦蓝谷露曼春寻枫寻山慕槐凝绿凝梅醉文听雪以珊友柳孤珊山芙向凡如巧从彤南翠天凝";
		String s8 = "伟刚勇毅俊峰强军平保东文辉力明永健世广志义兴良海山仁波宁贵福生龙元全国胜学祥才发武新利清飞彬富顺信子杰涛昌成康星光天达安岩中茂进林有坚和彪博诚先敬震振壮会思群豪心邦承乐绍功松善厚庆磊民友裕河哲江超浩亮政谦亨奇固之轮翰朗伯宏言若鸣朋斌梁栋维启克伦翔旭鹏泽晨辰士以建家致树炎德行时泰盛雄琛钧";
		String s9 = "浩云 远葸 清瑜 墨晗 龙飞 宗良 维顺 瀚辰 改珍 思敏 长春 红年 孟钰 桐瑞 星月 中源行平 咏棣 作忠 宗佑 钟源 金山 泽中 习涛 宇矾 堂臻 一漪 一澍 永风 京明 彦哲 文嘉书宁 一毅 书乐 昊洲 书林 立立 霏雨 焯勾 岩松 扬菲 卫国 垌菲 喜成 晶林 荔荔 文烨建雄 金金 军生 致齐 书显 建新 金利 力千 轴毛 钊幸 珏珲 先涛 浩宇 小平 建基 琛琛烯冰 璇冰 孟学 韦嵘 宗耀 轺介 惠卿 宗台 茜冰 凤军 佳钰 小明 又仁 锴锐 招新 召营乘昊 永靖 小军 永静 汝君 思彤 汉元 依潼 依凡 欣瑜 逸樊 圣祥 楠楠 传方 欣尉 函珏城瑞 异才 传舫 奕灿 依培 嘉欣 艳秋 传祥 传禄 志强 焕香 志嘉 传 依衡 传荣 映廷东峰 传贵 逸矾 传福 海语 矾逸 文吉 知娴 再香 索娴 任杰 豫坤 留生 策驰 振中 林峰林丰 梁宏 临峰 临锋 传澎 矾豫 晓东 临风 传龙 若然 传鑫 凌风 大为 力仁 允灏 丽明利仁 宝涛 佳明 筱璇 思帅 政翰 宇博 文会 稼傲 佳烈 稼音 稼金 稼辛 稼竹 富豪 辰翔凯岳 敬海 振宇 锦容 锡海 钧玮 庆敏 文龙 逢厅 祚玮 全民 兴碧 乙默 金元 书含 雪容馥凤 璐菲 雨晗 馥毓 子 梦伊 家池 梦菲 梦如 洪娇 羽姗 校国 如姬 红延 记言 科业蕊瑗 定峰 智勇 言卿 羽纯 康庆 志佳 如真 蕊菁 馥连 强强 羽真 雨洋 厚源 厚军 璧宁品言 志楷 伟康 品声 宝影 志勇 容伊 本康 美君 明驿 一赫 绪新 慧峰 坤铎 思君俊采 翔宇 飞菲 雪淇 广欢 泞鹪 庆昌 顺香 梦暄 惟 欣逸 晓坤 广应 其运 淇兴 镜桦季恒 书帛 炀霏 龙斌 玉华 卉霖 玮宏 永明 宇浩 少春 续豪 雁君 誉玮 培杰 绢踏 稀绚德友 英智 双庆 子辰 子芯 蒙蒙 迄 玮檬 牧归 佳龙 靖心 炜航 玉平 江华 兴友 嘉锦天哲 珈慧 茂溪 馨蔓 诵旭 丰源 微云 隆 为民 祥熙 忆轩 俊屹 营宝 姝妤 毓徽 苑涵顺耀 泽伟 明荣 橙 佳乐 晓晴 齐天 希宗 泣涵 和峰 松南 峻凝 连超 衍煊 是羽 弘渝驭轩 子含 訾劾 成秀 艳君 女雯 耀耀 羽茜 玉抒 浩瑞 琰苗 小轩 志波 煜景 格峰思聪 昕瞳 奕杉 孟绅 正光 振武 恩仪 永峻 文京 逸然 国诚 之伦 毅百 龙淼 柘凤云帆 方宁 明惟 庆详 万军 清泉 亦罗 胤历 谢君 嘉玮 丹妮 帅明 竹儿 紫薇 秋宇楠 碛 宝林 世吉 永祺 奕心 培致 修为 伟珍 山东 国邑 春蕴 珂菲 广博 文姝 春刚 宏阳芸仪 倾 佳骐 华宁 雨丹 学宝 继宁 鹏先 浚 震昊 欣澎 栎米 温欣 昭君 永光 宇洋 婉彤佳萸 西西 唐青 红平 壁霰 若彤 一玮 一薄 添睿 海轩 嘉辉 嘉欣 健烨 周华 泰国 月康宾盟 锡明 欣研 天印 琰沣 恒铭 天晴 钧涵 佳宇 梓言 志勇 家乐 珧冬 若木 启波 久宣成宏 欣鑫 如钰 揖 冰月 天宇 一帆 钦泽 鑫嫒 又铭 恒伟 鹭洋 勇清 霈泽 珂佳 遥来";
		String s10 = "世 舜 丞 主 产 仁 仇 仓 仕 仞 任  伋 众 伸 佐 佺 侃 侪 促 俟 信 俣   修 倝 倡 倧 偿 储 僖 僧 僳 儒 俊  伟 列 则 刚 创 前 剑 助 劭 势 勘  参 叔 吏 嗣 士 壮 孺 守 宽 宾 宋  宗 宙 宣 实 宰 尊 峙 峻 崇 崈 川   州 巡 帅 庚 战 才 承 拯 操 斋 昌  晁 暠 曹 曾 珺 玮 珹 琒 琛 琩 琮  琸 瑎 玚 璟 璥 瑜 生 畴 矗 矢 石  磊 砂 碫 示 社 祖 祚 祥 禅 稹 穆  竣 竦 综 缜 绪 舱 舷 船 蚩 襦 轼  辑 轩 子 杰 榜 碧 葆 莱 蒲 天 乐  东 钢 铎 铖 铠 铸 铿 锋 镇 键 镰  馗 旭 骏 骢 骥 驹 驾 骄 诚 诤 赐  慕 端 征 坚 建 弓 强 彦 御 悍 擎  攀 旷 昂 晷 健 冀 凯 劻 啸 柴 木  林 森 朴 骞 寒 函 高 魁 魏 鲛 鲲  鹰 丕 乒 候 冕 勰 备 宪 宾 密 封  山 峰 弼 彪 彭 旁 日 明 昪 昴 胜  汉 涵 汗 浩 涛 淏 清 澜 浦 澉 澎  澔 濮 濯 瀚 瀛 灏 沧 虚 豪 豹 辅  辈 迈 邶 合 部 阔 雄 霆 震 韩 俯  颁 颇 频 颔 风 飒 飙 飚 马 亮 仑  仝 代 儋 利 力 劼 勒 卓 哲 喆 展  帝 弛 弢 弩 彰 征 律 德 志 忠 思  振 挺 掣 旲 旻 昊 昮 晋 晟 晸 朕  朗 段 殿 泰 滕 炅 炜 煜 煊 炎 选  玄 勇 君 稼 黎 利 贤 谊 金 鑫 辉  墨 欧 有 友 闻 问";
		
		Set<String> fullSet = new HashSet<String>();
		fullSet.addAll(StarStringUtils.parseStr2SingleStrList(s1));
		fullSet.addAll(StarStringUtils.parseStr2SingleStrList(s2));
		fullSet.addAll(StarStringUtils.parseStr2SingleStrList(s3));
		fullSet.addAll(StarStringUtils.parseStr2SingleStrList(s4));
		fullSet.addAll(StarStringUtils.parseStr2SingleStrList(s5));
		fullSet.addAll(StarStringUtils.parseStr2SingleStrList(s6));
		fullSet.addAll(StarStringUtils.parseStr2SingleStrList(s7));
		fullSet.addAll(StarStringUtils.parseStr2SingleStrList(s8));
		fullSet.addAll(StarStringUtils.parseStr2SingleStrList(s9));
		fullSet.addAll(StarStringUtils.parseStr2SingleStrList(s10));
		
		System.out.println(fullSet.size());
		
	}

}
